log/benchmark/ruby_2_6_2.log
$ ruby -v
ruby 2.6.2p47 (2019-03-13 revision 67232) [x86_64-linux]

+ bundle exec puma -e production --workers=4 --threads=1 --preload
[17330] Puma starting in cluster mode...
[17330] * Version 3.12.0 (ruby 2.6.2-p47), codename: Llamas in Pajamas
[17330] * Min threads: 1, max threads: 1
[17330] * Environment: production
[17330] * Process workers: 4
[17330] * Preloading application
[17330] * Listening on tcp://0.0.0.0:3000
[17330] ! WARNING: Detected 1 Thread(s) started in app boot:
[17330] ! #<Thread:0x000055b8eecab7f8@/home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:299 sleep> - /home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:301:in `sleep'
[17330] Use Ctrl-C to stop
[17330] - Worker 0 (pid: 17365) booted, phase: 0
[17330] - Worker 1 (pid: 17371) booted, phase: 0
[17330] - Worker 2 (pid: 17378) booted, phase: 0
[17330] - Worker 3 (pid: 17387) booted, phase: 0
+ ab -n 10000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   33.483 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      534223902 bytes
HTML transferred:       527190000 bytes
Requests per second:    298.66 [#/sec] (mean)
Time per request:       13.393 [ms] (mean)
Time per request:       3.348 [ms] (mean, across all concurrent requests)
Transfer rate:          15581.05 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    10   13   4.7     11     118
Waiting:       10   13   4.7     11     118
Total:         10   13   4.7     11     118

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     12
  75%     15
  80%     16
  90%     18
  95%     23
  98%     28
  99%     30
 100%    118 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts
Document Length:        52719 bytes

Concurrency Level:      4
Time taken for tests:   3.490 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      53422294 bytes
HTML transferred:       52719000 bytes
Requests per second:    286.54 [#/sec] (mean)
Time per request:       13.959 [ms] (mean)
Time per request:       3.490 [ms] (mean, across all concurrent requests)
Transfer rate:          14949.07 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    10   14   4.7     11      44
Waiting:       10   14   4.7     11      44
Total:         10   14   4.7     11      44

Percentage of the requests served within a certain time (ms)
  50%     11
  66%     15
  75%     16
  80%     17
  90%     18
  95%     24
  98%     28
  99%     34
 100%     44 (longest request)
+ ps aux
+ grep puma
+ head -n1
+ cut '-d ' -f3
+ xargs kill
[17330] - Gracefully shutting down workers...
+ sleep 5
/home/k0kubun/tmp/bench.sh: line 8: 17330 Terminated              bundle exec puma -e production --workers=4 --threads=1 --preload
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 8
+ bundle exec puma -e production --workers=4 --threads=1 --preload
[17783] Puma starting in cluster mode...
[17783] * Version 3.12.0 (ruby 2.6.2-p47), codename: Llamas in Pajamas
[17783] * Min threads: 1, max threads: 1
[17783] * Environment: production
[17783] * Process workers: 4
[17783] * Preloading application
[17783] * Listening on tcp://0.0.0.0:3000
[17783] ! WARNING: Detected 1 Thread(s) started in app boot:
[17783] ! #<Thread:0x00005612fe28d388@/home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:299 sleep> - /home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:301:in `sleep'
[17783] Use Ctrl-C to stop
[17783] - Worker 0 (pid: 17810) booted, phase: 0
[17783] - Worker 1 (pid: 17815) booted, phase: 0
[17783] - Worker 2 (pid: 17824) booted, phase: 0
[17783] - Worker 3 (pid: 17834) booted, phase: 0
+ ab -n 10000 -c 4 localhost:3000/posts.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts.json
Document Length:        39548 bytes

Concurrency Level:      4
Time taken for tests:   68.583 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      399970000 bytes
HTML transferred:       395480000 bytes
Requests per second:    145.81 [#/sec] (mean)
Time per request:       27.433 [ms] (mean)
Time per request:       6.858 [ms] (mean, across all concurrent requests)
Transfer rate:          5695.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    20   27   8.8     22     121
Waiting:       20   27   8.8     22     121
Total:         20   27   8.8     22     122

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     29
  75%     29
  80%     30
  90%     38
  95%     48
  98%     56
  99%     57
 100%    122 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts.json
Document Length:        39548 bytes

Concurrency Level:      4
Time taken for tests:   7.108 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      39997000 bytes
HTML transferred:       39548000 bytes
Requests per second:    140.69 [#/sec] (mean)
Time per request:       28.431 [ms] (mean)
Time per request:       7.108 [ms] (mean, across all concurrent requests)
Transfer rate:          5495.33 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:    21   28   9.6     26      78
Waiting:       21   28   9.5     26      77
Total:         21   28   9.6     27      78

Percentage of the requests served within a certain time (ms)
  50%     27
  66%     29
  75%     30
  80%     31
  90%     40
  95%     54
  98%     56
  99%     62
 100%     78 (longest request)
+ ps aux
+ grep puma
+ head -n1
+ xargs kill
+ cut '-d ' -f3
[17783] - Gracefully shutting down workers...
+ sleep 5
/home/k0kubun/tmp/bench.sh: line 8: 17783 Terminated              bundle exec puma -e production --workers=4 --threads=1 --preload
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 8
+ bundle exec puma -e production --workers=4 --threads=1 --preload
[18503] Puma starting in cluster mode...
[18503] * Version 3.12.0 (ruby 2.6.2-p47), codename: Llamas in Pajamas
[18503] * Min threads: 1, max threads: 1
[18503] * Environment: production
[18503] * Process workers: 4
[18503] * Preloading application
[18503] * Listening on tcp://0.0.0.0:3000
[18503] ! WARNING: Detected 1 Thread(s) started in app boot:
[18503] ! #<Thread:0x000056359918c368@/home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:299 sleep> - /home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:301:in `sleep'
[18503] Use Ctrl-C to stop
[18503] - Worker 0 (pid: 18530) booted, phase: 0
[18503] - Worker 1 (pid: 18536) booted, phase: 0
[18503] - Worker 2 (pid: 18545) booted, phase: 0
[18503] - Worker 3 (pid: 18554) booted, phase: 0
+ ab -n 10000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        929 bytes

Concurrency Level:      4
Time taken for tests:   6.138 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      16324822 bytes
HTML transferred:       9290000 bytes
Requests per second:    1629.32 [#/sec] (mean)
Time per request:       2.455 [ms] (mean)
Time per request:       0.614 [ms] (mean, across all concurrent requests)
Transfer rate:          2597.50 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2    2   1.7      2      60
Waiting:        2    2   1.6      2      59
Total:          2    2   1.7      2      60

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      3
  80%      3
  90%      3
  95%      3
  98%      5
  99%     10
 100%     60 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts/1
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1
Document Length:        929 bytes

Concurrency Level:      4
Time taken for tests:   0.851 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      1632312 bytes
HTML transferred:       929000 bytes
Requests per second:    1175.56 [#/sec] (mean)
Time per request:       3.403 [ms] (mean)
Time per request:       0.851 [ms] (mean, across all concurrent requests)
Transfer rate:          1873.90 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2    3   2.2      3      28
Waiting:        2    3   2.1      2      28
Total:          2    3   2.2      3      28

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      4
  75%      4
  80%      5
  90%      5
  95%      6
  98%      9
  99%     14
 100%     28 (longest request)
+ ps aux
+ grep puma
+ head -n1
+ cut '-d ' -f3
+ xargs kill
[18503] - Gracefully shutting down workers...
+ sleep 5
/home/k0kubun/tmp/bench.sh: line 8: 18503 Terminated              bundle exec puma -e production --workers=4 --threads=1 --preload
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 8
+ bundle exec puma -e production --workers=4 --threads=1 --preload
[18725] Puma starting in cluster mode...
[18725] * Version 3.12.0 (ruby 2.6.2-p47), codename: Llamas in Pajamas
[18725] * Min threads: 1, max threads: 1
[18725] * Environment: production
[18725] * Process workers: 4
[18725] * Preloading application
[18725] * Listening on tcp://0.0.0.0:3000
[18725] ! WARNING: Detected 1 Thread(s) started in app boot:
[18725] ! #<Thread:0x000055ed86f53948@/home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:299 sleep> - /home/k0kubun/.rbenv/versions/2.6.2/lib/ruby/gems/2.6.0/gems/activerecord-5.2.2.1/lib/active_record/connection_adapters/abstract/connection_pool.rb:301:in `sleep'
[18725] Use Ctrl-C to stop
[18725] - Worker 0 (pid: 18752) booted, phase: 0
[18725] - Worker 1 (pid: 18758) booted, phase: 0
[18725] - Worker 2 (pid: 18765) booted, phase: 0
[18725] - Worker 3 (pid: 18775) booted, phase: 0
+ ab -n 10000 -c 4 localhost:3000/posts/1.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1.json
Document Length:        279 bytes

Concurrency Level:      4
Time taken for tests:   5.987 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      7280000 bytes
HTML transferred:       2790000 bytes
Requests per second:    1670.27 [#/sec] (mean)
Time per request:       2.395 [ms] (mean)
Time per request:       0.599 [ms] (mean, across all concurrent requests)
Transfer rate:          1187.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1    2   1.5      2      49
Waiting:        1    2   1.4      2      49
Total:          2    2   1.5      2      49

Percentage of the requests served within a certain time (ms)
  50%      2
  66%      2
  75%      2
  80%      3
  90%      3
  95%      3
  98%      6
  99%      9
 100%     49 (longest request)
+ ab -n 1000 -c 4 localhost:3000/posts/1.json
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Completed 1000 requests
Finished 1000 requests


Server Software:
Server Hostname:        localhost
Server Port:            3000

Document Path:          /posts/1.json
Document Length:        279 bytes

Concurrency Level:      4
Time taken for tests:   0.796 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      728000 bytes
HTML transferred:       279000 bytes
Requests per second:    1256.58 [#/sec] (mean)
Time per request:       3.183 [ms] (mean)
Time per request:       0.796 [ms] (mean, across all concurrent requests)
Transfer rate:          893.35 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     2    3   2.0      2      29
Waiting:        2    3   2.0      2      29
Total:          2    3   2.0      3      29

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      4
  80%      4
  90%      5
  95%      5
  98%      6
  99%     11
 100%     29 (longest request)
+ ps aux
+ grep puma
+ head -n1
+ cut '-d ' -f3
+ xargs kill
[18725] - Gracefully shutting down workers...
+ sleep 5
/home/k0kubun/tmp/bench.sh: line 8: 18725 Terminated              bundle exec puma -e production --workers=4 --threads=1 --preload
+ for request_path in /posts /posts.json /posts/1 /posts/1.json
+ sleep 8